export default {
  //通用
  '0': '操作成功',
  '1': '操作失败',
  '1000000': '系统异常',
  '1000001': '缺少访问凭证',
  '1000002': '用户登录已失效,请重新登录',
  '1000003': '用户未授权',
  '1000004': '请求接口地址有误',
  '1000005': '缺少参数或参数错误',
  '1000006': '参数类型或长度、范围等条件校验失败',

  //core 用户
  '2000000': '用户名已存在',
  '2000001': '用户名或密码有误',
  '2000002': '验证码错误',
  '2000003': '用户已禁用',
  '2000004': '用户已注销',
  '2000005': '用户名或旧密码有误',
  '2000006': '手机号码已存在',

  //core 角色
  '2001000': '角色名称已存在',

  //core 资源
  '2002000': '资源名称已存在',
  '2002001': '上级资源不存在',
  '2002002': '资源类型有误',
  '2002003': '路径不能为空',
  '2002004': '顶级资源只能是模块或菜单类型',
  '2002005': '权限类型有误',
  '2002006': '资源编码已存在',

  //文件上传
  '2003000': '文件上传失败',

  // Core 组织架构
  '2004000': '组织名称已存在',
  '2004001': '上级组织不存在',
};
