export default {
  //通用
  '0': '操作成功',
  '1': '操作失敗',
  '1000000': '系統異常',
  '1000001': '缺少訪問憑證',
  '1000002': '用戶登錄已失效,請重新登錄',
  '1000003': '用戶未授權',
  '1000004': '請求接口地址有誤',
  '1000005': '缺少參數或參數錯誤',
  '1000006': '參數類型或長度、範圍等條件校驗失敗',

  //core 用户
  '2000000': '用戶名已存在',
  '2000001': '用戶名或密碼有誤',
  '2000002': '驗證碼錯誤',
  '2000003': '用戶已禁用',
  '2000004': '用戶已註銷',
  '2000005': '用戶名或舊密碼有誤',
  '2000006': '手機號碼已存在',

  //core 角色
  '2001000': '角色名稱已存在',

  //core 资源
  '2002000': '資源名稱已存在',
  '2002001': '上級資源不存在',
  '2002002': '資源類型有誤',
  '2002003': '路徑不能為空',
  '2002004': '頂級資源只能是模塊或菜單類型',
  '2002005': '權限類型有誤',
  '2002006': '資源編碼已存在',

  //文件上传
  '2003000': '文件上傳失敗',
  '2003001': '文件不存在',

  // Core 組織架構
  '2004000': '組織名稱已存在',
  '2004001': '上級組織不存在',
};
