export default {
	//通用
	'0': '操作成功',
	'1': '操作失敗',
	'1000000': '系統錯誤',
	'1000001': '缺少訪問憑證',
	'1000002': '用戶登錄已失效,請重新登錄',
	'1000003': '請求接口地址有誤',
	'1000004': '缺少參數或參數錯誤',
	'1000005': '參數類型或長度、範圍等條件校驗失敗',

	//core 用户
	'2000000': '用戶名已存在',
	'2000001': '用戶名或密碼有誤',
	'2000002': '驗證碼錯誤',
	'2000003': '用戶已禁用',
	'2000004': '用戶已註銷',
	'2000005': '用戶名或舊密碼有誤',
	'2000006': '手機號碼已存在',

	//core 角色
	'2001000': '角色名稱已存在',

	//core 资源
	'2002000': '資源名稱已存在',
	'2002001': '上級資源不存在',
	'2002002': '資源類型有誤',
	'2002003': '接口類型的Path字段不能為空',
	'2002004': '頂級資源只能是菜單類型',

	//文件上传
	'2003000': '文件上傳失敗'
};